{"inkVersion":21,"root":[["\n","^En l'an 2087, dans les bas-fonds de Neo-Berlin, deux jeunes ados n'ayant connu que l'amour inconditionnel de leur père se retrouvent dans l'impasse lorsque celui-ci tomba gravement malade et furent mis à la porte par leur détestable belle-mère.","\n","^\n ",{"->":"Scene1"},"\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"Scene1":["ev","str","^VFXTest","/str",{"x()":"LoadVFX","exArgs":1},"pop","/ev","\n","ev","str","^Chambre","/str",4,{"x()":"fadeBg","exArgs":2},"pop","/ev","\n","^HORS DE MA VUE !!! Ne cherchez pas à revenir ici, votre père est dans cette situation par votre faute vous ne le méritez pas !","\n",{"->":"Ruelle"},{"#f":1}],"Ruelle":[["^Après quelques heures à errer sous la pluie, Hansel et Grethel désormais démunis se regardent dans le blanc des yeux d'un air livide signe de leur désespoir.","\n","^G-Mon frère comment allons nous faire, papa est mourant et nous ne pouvons plus rentrer chez nous.","\n","^H- \"Greth...","\n","^viens par là,","\n","^je sais à quel point tu es triste et je le suis tout autant mais il ne faut pas qu'on se laisse abattre.","\n","^G-Mais notre père... je n'ai jamais eu confiance en notre belle-mère je ne veux pas le laisser seul.","\n","^H-Moi aussi Greth mais ne t'inquiète pas, j'ai quelques plans pour sortir d'ici mais ça risque de prendre du temps avant d'y parvenir alors fais moi confiance sœurette.","\n","^En attendant on va devoir se débrouiller seuls...","\n","^et trouver de quoi manger ainsi qu'un lieu où crécher.","\n","^G-Tu sais que toi comme moi nous avons confiance en tes premiers instinct.","\n","ev","str","^Fouiller la ruelle","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Evoquer les plans","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":".^.^.Fouiller_la_ruelle"},"\n",{"->":".^.^.Fouiller_la_ruelle"},{"#f":5}],"c-1":[{"->":".^.^.Fouiller_la_ruelle.35.Evoquer_les_plans"},"\n",{"->":".^.^.Fouiller_la_ruelle"},{"#f":5}],"Fouiller_la_ruelle":["^H-Tant qu'il est encore temps essayons de recolter quelques chose qui pourrait nous aider a passer la nuit, le mieux serait d'aller chacun de notre...","\n","^G-NON,","\n","^...,","\n","^Restons ensemble je ne veux pas qu'il t'arrive quelque chose, père est sur son lit de mort et la basse ville n'est pas recommendable, et j'aurai besoin de toi si il m'arrive une bricole.","\n","^H-D'accord, avançons ensemble, commençons par ce distributeur, tu penses pouvoir le hacker ?","\n","^G-Mmmhh,","\n","^H-Alors qu'es-ce ça donne.","\n","^G-Je crois qu'il est déconnecté.","\n","^H-Laisse moi essayer de casser la vitre avec mon implant","\n","^G-Mais on risque de se faire repérer.","\n","^H-T'inquiète je sais ce que je fais.","\n","^SFX *CRACK* bruit de vitre qui se casse","\n","^H-Merde, c'est avarié...","\n","^G-Il n'y a rien d'autre ?","\n","^H-Non, rien de rien tout est pourri on va devoir chercher ailleur.","\n","^(peut-etre essayer de brancher un truc et ça allume les neon)","\n","^NEON ON ",{"->":".^.35.Evoquer_les_plans.g-0.Neon_ON"},"\n",[["^H-Je pense avoir un plan pour dormir ce soir mais il se trouve plus loin dans la ville, il faut qu'on se sépare pour passer inaperçu","\n","^G-Hans tu sais que je peux pas sortir loin en ville sans toi. Cette ville me fait peur.","\n","^H-Allez Greth, c'est chez une bonne connaissance, il m'a déja sauvé de plusieurs affaires.","\n","^G-Tu me parles de ton collègue Max, celui qui t'as couté ce bras ?","\n","^H-Oui on a presque perdu la vie ce jour la mais c'etait lui qui m'a sorti de la Greth je lui doit beaucoup et il peut encore nous aider.","\n","^G-Mais c'est lui qui a eu l'idée d'aller la bas il me semble.","\n","^H-Oui tu as raison Greth, peut être que je devrai t'écouter mais je n'ai pas d'autre solution pour le moment.","\n","^G-Je suis sur que tu en trouveras une rapidement, après tout c'est toi qui connais le mieux la basse ville.","\n",[["^SFX *Zing (genre neon qui s'allume)","\n","^H et G-*air interloqué*","\n","^H-On y voit plus clair tout à coup.","\n","^G-Oui la ville commence à s'illuminer à cette heure-ci.","\n","^H-Regarde les lumières on dirait que celui qui les a posés la voulait vraiment qu'on le remarque.","\n","^G-Ahah(c'est nul a chier faut changer)Oui c'est sur que ce n'est pas très discret.","\n","^H-Allons voir de plus près ça pique ma curiosité.","\n",{"->":"Ruelle.0.g-0"},{"#f":5,"#n":"Neon_ON"}],{"#f":5,"#n":"g-0"}],{"#f":5,"#n":"Evoquer_les_plans"}],null],"ev","str","^Se drirger vers le lieu","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Dire a Hansel que c'est suspect","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":[{"->":".^.^.c-3.2.repGreth"},"\n",{"->":".^.^.^.g-0"},{"#f":5}],"c-3":[{"->":".^.2.repGreth"},"\n",[["^G- Allons-y je te suis Hans mais fait attention, les apparences sont souvent trompeuses dans la basse ville.","\n","^H- Je comprend ce que tu essaies de me faire voir mais c'est surement un commerce de nuit qui vient d'ouvrir ces portes, rien de quoi s'inquiéter.","\n","^G- Oui désolé c'est moi qui réfléchit trop.","\n","^H-Ne te reproche pas cela ,c'est aussi pour ça que j'ai besoin de toi Greth.","\n","^G-Merci, je te laisse prendre les devants une fois dedans, tu es plus doué que moi la dessus.","\n","^H-Parfait allons-y.","\n",{"->":"Ruelle.0.g-0"},{"#f":5,"#n":"repGreth"}],null],{"#f":5}],"#f":5}],"g-0":[[[{"->":"Sous_sol"},[{"->":"Sous_sol"},{"#f":5,"#n":"g-1"}],{"->":".^.g-1"},{"#f":5,"#n":"g-0"}],null],{"#f":5}]}],{"#f":1}],"Sous_sol":[["^H : C'est pas du tout ce quoi on s'attendait, l'endroit etait plus attrayant de l'extérieur.","\n","^G : C'est quoi cet endroit ? On dirait une sorte de bazar bloqué dans le passé.","\n","^H : Mhh je doute qu'on y trouve quoi que ce soit d'intéressant tout est poussiéreux et délabré sans parler de l'odeur mais jetons quand même un coup d'oeil autour on sait jamais sur quoi on va tomber.","\n","^G : Oui ça tu l'as dis, j'ai l'impression d'être observé alors hâtons nous.","\n","ev","str","^décrire l'odeur","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^décrire la pièce","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^parler de l'objet sur le comptoir","/str","/ev",{"*":".^.c-2","flg":20},["ev",{"^->":"Sous_sol.0.26.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^driiing*",{"->":"$r","var":true},null]}],{"c-0":[{"->":".^.^.odeur"},"\n",{"->":".^.^.odeur"},{"#f":5}],"c-1":[{"->":".^.^.odeur.g-0.piece"},"\n",{"->":".^.^.odeur"},{"#f":5}],"c-2":[{"->":".^.^.odeur.g-0.piece.g-1.objet"},"\n",{"->":".^.^.odeur"},{"#f":5}],"c-3":["ev",{"^->":"Sous_sol.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.26.s"},[{"#n":"$r2"}],"\n","^M : Oh là, excusez-moi jeunes gens, je ne vous ai pas du tout entendu entrer  !","\n","^HetG : Et nous on ne s'attendait pas à voir quelqu'un ici.","\n","^M : Veuillez m'excuser si je vous ai fait peur, permettez moi de me présenter, je suis celui qu'on appelle \"le Majordome\", propriétaire du prestigieux \"Hexe Holle\".","\n","^H : Le Hexe Holle ? Jamais entendu parler et pourtant je connais bien ce secteur de la Basse-ville.","\n","^M : Il n'y a pas de mal à cela vous êtes jeunes, mon établissement est très réputé auprès des amateurs de jeux nous ne cherchons pas à être connu de tous.","\n","^H : De jeu ? Genre CyberBrawl ou NeuroMaze ? ","\n","^M : Non, je parle ici de jeux plus anciens, plus nobles que ceux de nos jours, pas de sang pas de piratage juste votre réflexion et bien sûr une petite part de chance mais c'est ce qui rend chaque partie intéressante.","\n","^H : Et on y gagne quoi ? des métadonnées, des NeuMark ? ","\n","^M : tout se dont vous avez besoin peut être mis en jeu, nous som- enfin \"je\" suis plein de ressources. Et donc que recherchez vous jeunes gens ?","\n","^G : Le mieux serait du NeuMark mais s'il est traçable alors il sera inutilisable dans beaucoup d'endroits.","\n","^H : Et avec les métadonnées ? on pourrait trouver des acheteurs non, mon ami Vanz saura vers qui m'orienter si il est sortie de taule...","\n","^M : Je vous laisse du temps pour vous décider, en tout cas mes portes sont ouvertes faites moi signes quand vous aurez choisi","\n",{"->":".^.^.odeur"},{"#f":5}],"odeur":[[[[[[{"->":"Hall_Casino"},{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"objet"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"piece"}],{"#f":5,"#n":"g-0"}],{"#f":5}]}],{"#f":1}],"Hall_Casino":[["ev","str","^Croupier1","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Croupier2","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Croupier3","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":[{"->":"CroupierCarreaux"},"\n",{"#f":5}],"c-1":[{"->":"CroupierCoeur"},"\n",{"#f":5}],"c-2":[{"->":"CroupierTrefle"},"\n",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^curseur = 0 && CroupierCarreaux && CroupierCoeur && CroupierTrefle ",{"->":".^.^.11"},null],"#f":5}],{"->":"CurseurGrethel"},"\n",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^curseur = 2 && CroupierCarreaux && CroupierCoeur && CroupierTrefle ",{"->":".^.^.11"},null],"#f":5}],{"->":"CurseurHansel"},"\n",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^curseur = 1 && CroupierCarreaux && CroupierCoeur && CroupierTrefle ",{"->":".^.^.11"},null],"#f":5}],{"->":"CurseurMid"},"\n",{"#f":5}]}],{"#f":1}],"CroupierCarreaux":[{"->":"Hall_Casino"},{"#f":1}],"CroupierCoeur":[{"->":"Hall_Casino"},{"#f":1}],"CroupierTrefle":[{"->":"Hall_Casino"},{"#f":1}],"CurseurGrethel":["^Grethel a récolté suffisamment d'indices sur le lieu et l'identité du Majordome, ce qui lui permet de convaincre son frère de partir d'ici (Labyrinthe out)","\n","end",{"#f":1}],"CurseurHansel":["^Si grethel n'a pas réussi a raisonner son frère","\n","^alors Hansel sombre dans l'addiction et H et G se retrouvent piégés dans le casino (Grethel suis son frère car elle pense qu'il a raison)","\n","end",{"#f":1}],"CurseurMid":["^Si grethel comprend que le casino est un mauvais endroit et ne suit pas son frère, sans pour autant arriver a lui faire comprendre, elle se voit éjectée du casino et se retrouve dans le sous-sol avec le majordome, elle parle avec ce dernier et à la possibilité de lui proposer un quitte ou double pour chercher son frère si vous avez parlé au croupier qui donne une certaine information, l'IA étant joueuse accepte et si grethel gagne l'IA libère hansel (good ending) sinon elle retourne dans le casino avec son frère (bad ending). Si le joueur ne veut pas faire le quitte ou double grethel sort sans son frère du casino en se promettant de revenir le chercher.","\n","end",{"#f":1}],"changeBg":[{"temp=":"backgroundName"},{"#f":1}],"fadeBg":[{"temp=":"duration"},{"temp=":"backgroundName"},{"#f":1}],"flipX":[{"temp=":"character"},{"#f":1}],"flipY":[{"temp=":"character"},{"#f":1}],"placeTo":[{"temp=":"position"},{"temp=":"character"},{"#f":1}],"moveTo":[{"temp=":"duration"},{"temp=":"position"},{"temp=":"character"},{"#f":1}],"fadeIn":[{"temp=":"duration"},{"temp=":"character"},{"#f":1}],"fadeOut":[{"temp=":"duration"},{"temp=":"character"},{"#f":1}],"show":[{"temp=":"character"},{"#f":1}],"hide":[{"temp=":"character"},{"#f":1}],"face":[{"temp=":"emotion"},{"temp=":"character"},{"#f":1}],"thenWaitPlayer":[{"#f":1}],"playSound":[{"temp=":"name"},{"#f":1}],"rotate":[{"temp=":"b"},{"temp=":"ang"},{"#f":1}],"global decl":["ev",0,{"VAR=":"curseur"},0,{"VAR=":"A"},"/ev","end",null],"#f":1}],"listDefs":{}}